import Tutorial.Notation
import Definition.Tactic

/--
### 等价关系
当一个二元关系 R 满足以下三个条件时，我们称之为等价关系
- 反身性/自反性（**refl**exivity） x R x ，表示x与自身具有关系R
- 对称性（**symm**etry） x R y → y R x ，表示当x与y具有关系R时，y与x也具有关系R
- 传递性（**trans**tivity） x R y ∧ y R z → x R z ，表示当x与y具有关系R，y与z具有关系R时，x与z也具有关系R
#### 等价关系举例
- 通常意义上的相等(=)即是一个等价关系。
- 同余关系(≡)是一个等价关系。
- 几何上的平行关系(∥)是一个等价关系。
- 几何上的三角形相似关系(∽)和全等关系(≌)是等价关系。
#### 非等价关系举例
- 小于关系(<)只满足传递性，不满足反身性和对称性，所以不是等价关系。
- 小于等于关系(≤)满足自反性和传递性，但是不满足对称性，所以不是等价关系。
- 集合的包含关系(⊆)满足自反性和传递性，但是不满足对称性，所以不是等价关系。
- 几何上的垂直关系(⟂)只满足对称性，不满足反身性和传递性，所以不是等价关系。
-/
example : x + 7 = x + 7 := by
-- 当我们要证明的目标为一个等式，且左右两边完全一样时，我们可以使用等价关系的反身性来结束证明。
  refl
