import Definition.Basic.Tutorial.Notation
import Definition.Basic.Tactic

/--
### 精准代换
代换指令可以智能匹配目标中可被代换的部分，例如本例中会按出现顺序依次使用目标中的 a, b, c 替换 h 中的形参 n ，然后使用替换后的 a + 0, b + 0 以及 c + 0 去目标中尝试匹配，看目标是否存在相同的部分，若匹配成功，则停止尝试并执行代换。
因此，当目标中多次出现可被代换的部分时（在本例中为等式左边的 (b+0), (c+0) 和等式右边的 (b+0) 三部分），代换指令会将第一次匹配成功（在本例中即为(b+0)）的所有可代换部分（在本例中为等号左右各一处）替换为代换后的值。
但是在本例中，在等式左右两侧的 (b+0) 本就完全一样，因而将其代换为 b 并不能有效推进证明进度。若想直接对 (c+0) 这一部分进行代换，可以为 h 指定明确的目标 c ，从而直接匹配 (c+0) 进行精准代换。
-/
example (add_zero : ∀ (n : ℕ),  n + 0 = n) : a + (b + 0) + (c + 0) = a + (b + 0) + c := by
  -- 使用精准代换，代换一次完成证明
  rewrite [add_zero c]
  refl
